УРВ_файловая/src/DataProcessors/РасписаниеЛК/РасписаниеЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасписаниеЛК</name>
  <attributes>
    <name>ТолькоПоСотруднику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьЛегенду</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКолонкиДаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиСотрудника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборПоСотрудникам</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступныеДействия</name>
  </attributes>
  <tabularSections>
    <name>ТаблицаРасписания</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.Работы</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВремяОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Абоненты</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ПользователиСервисов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУслуги</name>
      <type>
        <types>CatalogRef.ВидыУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>ТемаВопроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЭлементаРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>EnumRef.РезультатыКонсультации</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЗаписи</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговыйСтатус</name>
      <type>
        <types>EnumRef.ИтоговыеСтатусыРасписанияЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторЗаписи</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистраторРезультата</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветФона</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветТекста</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноДляСамозаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрочнаяЗапись</name>
      <comment>Срочная запись (Перенести при возможности на более ранний срок)</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписи</name>
      <type>
        <types>EnumRef.ТипыЗаписейЛК</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайнийСрок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретитьЗамещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтактныеТелефоны</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Событие</name>
      <type>
        <types>DocumentRef.Обращение</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеXML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РаботаНазвание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УРВ_файловая/src/InformationRegisters/РолиСотрудниковЛК/РолиСотрудниковЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиСотрудниковЛК</name>
  <resources>
    <name>ДоступноСоздание</name>
    <comment>Сотрудник может создать новую запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноИзменение</name>
    <comment>Сотрудник может изменить запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПерепланирование</name>
    <comment>Сотрудник может перенести свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноБлокировка</name>
    <comment>Сотрудник может блокировать свою запись </comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноОтменаБлокировки</name>
    <comment>Сотрудник может отменить свою запись</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоступноПросмотрДругихСотрудников</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>EnumRef.РолиСотрудниковЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УРВ_файловая/src/DataProcessors/РасписаниеЛК/Forms/ФормаУстановкиОтбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БоР_ОбщийМодуль.ЗаполнитьРеквизитыИзПараметров(ЭтаФорма, Неопределено);

	МассивДоступныхСотрудников = РегистрыСведений.РолиСотрудниковЛК.ПолучитьМассивДоступныхСотрудников(Истина, Истина);

	Для каждого Сотрудник Из МассивДоступныхСотрудников Цикл
		строкаТЗ = Сотрудники.Добавить();
		строкаТЗ.Сотрудник	= Сотрудник;
		строкаТЗ.Пометка	= (ОтборПоСотрудникам.НайтиПоЗначению(Сотрудник) <> Неопределено);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ОтборПоСотрудникам.Очистить();
	
	строкиТЗ = Сотрудники.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для каждого строкаТЗ Из строкиТЗ Цикл
		ОтборПоСотрудникам.Добавить(строкаТЗ.Сотрудник);
	КонецЦикла;
	
	Если ОтборПоСотрудникам.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Необходимо выбрать хотя бы одного сотрудника!", 30);
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("ОтборПоСотрудникам", ОтборПоСотрудникам);
	Закрыть(СтруктураВозВрата);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	ОбработатьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	ОбработатьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИнвертироватьФлажки(Команда)
	ОбработатьФлажки();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлажки(НовоеЗначение = Неопределено)
	
	Для каждого строкаТЗ Из Сотрудники Цикл
		строкаТЗ.Пометка = ?(НовоеЗначение = Неопределено, НЕ строкаТЗ.Пометка, НовоеЗначение);
	КонецЦикла;
	
КонецПроцедуры
